app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
<div class="message_index">
<% post_user = User.find_by(id: post.user_id) %>