app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."to_user_id" = ? LIMIT ?  [["to_user_id", "6"], ["LIMIT", 1]]
---
  def new
     @to_user = User.find_by(id: params[:id])
     @posts = Post.where(to_user_id: @to_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "to_user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "5"], ["to_user_id", "1"], ["content", "お疲れ様！"], ["created_at", "2020-05-08 10:54:06.111611"], ["updated_at", "2020-05-08 10:54:06.111611"]]
---
  def create
    @to_user = User.find_by(id: params[:id])
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id,
      to_user_id: @to_user.id
    )
    if @post.save