app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name],
      password: params[:password],
      image_name: "default_img.png"
    )
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?)  [["name", "りらくたろう"], ["created_at", "2020-05-08 03:26:58.509972"], ["updated_at", "2020-05-08 03:26:58.509972"], ["image_name", "default_img.png"], ["password", "rerakutarou"]]

  def login
   @user = User.find_by(
     name: params[:name],
     password: params[:password]
   )
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "たつ"], ["password", "teratatsu916"], ["LIMIT", 1]]

def show
  @to_user = User.find_by(id: params[:id])
  @posts = Post.where(to_user_id: @to_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."to_user_id" = ?  [["to_user_id", "5"]]

def update
  @user = User.find_by(id: params[:id])
  if params[:image]
    @user.image_name = "#{@user.id}.jpg"
    image = params[:image]
    File.binwrite("public/user_images/#{@user.image_name}",image.read)
  end
  if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "7.jpg"], ["updated_at", "2020-05-09 05:33:36.718419"], ["id", 7]]